// @strict-types

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчетСуммы(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчетСуммы(Элементы.Товары.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыРасчета

// Расчет суммы.
// 
// Параметры:
//  СтрочкаДокумента - ДанныеФормыЭлементКоллекции -  Строка документа элементов формы
&НаКлиенте
Процедура РасчетСуммы(СтрочкаДокумента)
	
	СтрочкаДокумента.Сумма = СтрочкаДокумента.Количество * СтрочкаДокумента.Цена;

КонецПроцедуры



#КонецОбласти
